load-tests/fhir-api-load-test.yml
# FHIR API Load Test - Artillery Configuration
# Tests FHIR service endpoints for performance under load
#
# Usage: artillery run fhir-api-load-test.yml

config:
  target: 'http://localhost:8085'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 120
      arrivalRate: 200
      name: "Peak load"
    - duration: 60
      arrivalRate: 50
      name: "Cool down"
  
  defaults:
    headers:
      Content-Type: "application/fhir+json"
      Accept: "application/fhir+json"
      X-Tenant-ID: "test-tenant-001"
  
  variables:
    patientIds:
      - "patient-001"
      - "patient-002"
      - "patient-003"
      - "patient-004"
      - "patient-005"

scenarios:
  # Scenario 1: Patient Search (60% of traffic)
  - name: "FHIR Patient Search"
    weight: 60
    flow:
      - get:
          url: "/Patient?name=Smith"
          capture:
            - json: "$.entry[0].resource.id"
              as: "patientId"
      - think: 1

  # Scenario 2: Read Patient by ID (20% of traffic)
  - name: "FHIR Read Patient"
    weight: 20
    flow:
      - get:
          url: "/Patient/{{ $randomString() }}"
          beforeRequest: "setRandomPatientId"
      - think: 1

  # Scenario 3: Create Observation (10% of traffic)
  - name: "FHIR Create Observation"
    weight: 10
    flow:
      - post:
          url: "/Observation"
          json:
            resourceType: "Observation"
            status: "final"
            code:
              coding:
                - system: "http://loinc.org"
                  code: "4548-4"
                  display: "Hemoglobin A1c/Hemoglobin.total in Blood"
            subject:
              reference: "Patient/patient-001"
            valueQuantity:
              value: 7.5
              unit: "%"
              system: "http://unitsofmeasure.org"
              code: "%"
      - think: 2

  # Scenario 4: Search Observations (10% of traffic)
  - name: "FHIR Search Observations"
    weight: 10
    flow:
      - get:
          url: "/Observation?patient=Patient/patient-001&code=4548-4"
      - think: 1